<img src="images/intro.jpeg">

# Project - Pedidos

<div style="background-color: #2f648a; border-radius: 5px;"> 
    <center><h1 style="color: white; padding: 20px;">1. Imports</h1></center>
</div>

In [2]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile
import seaborn as sns
from matplotlib import pyplot as plt

<div style="background-color: #2f648a; border-radius: 5px;"> 
    <center><h1 style="color: white; padding: 20px;">2. Read Files</h1></center>
</div>

Importar as 3 bases de dados relativas às intervenções para 3 DataFrames pandas.

In [3]:
pedidos1 = pd.read_excel("databases/apura_iscte_lpedidos_ant.xlsx")

In [2]:
pedidos2 = pd.read_excel("databases/apura_iscte_lpedidos_apos.xlsx")

In [51]:
pedidos3 = pd.read_excel("databases/apura_iscte_m01.xlsx")

In [4]:
pedidos1.head(2)

,UTE_ID,ANO_MES,DATA_MOVIMENTO,TIPO_MOVIMENTO,DTIPO_MOVIMENTO,CENTROA,DCENTRO_AB,AREA_CURSO,ANO_CONCLUSAO_CURSO,CEST_SUPERIOR,...,DCPP,CAE_COLOCACAO,DCAE_COLOCACAO,TIPO_CONTRATO_COLOC,REGIME_CONTRATO_COLOC,REGIME_HORARIO,PAIS_COLOCACAO,TIPO_OCUPACAO,ANOMES_12INI,ANOMES_INI
0,4853974,201805,2018-05-11 18:03:16,43,MUDANÇAS CATEGORIA,123,CTEF Bragança,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,521.0,201705,201805
1,4853974,201803,2018-03-09 10:15:46,11,PEDIDOS DE EMPREGO AO LONGO DO MÊS,123,CTEF Bragança,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,201705,201805

In [32]:
pedidos2.head(2)

,UTE_ID,CodCEFP,CodMedidaOrcam,Descritivo CodMedidaOrcam,Sexo,DataNascimento,IdadeEmAnos,Categoria,CodHabilitacao,Habilitacao,...,Mes10,Mes10_Remuneracao,Mes10_Tipo,Mes11,Mes11_Remuneracao,Mes11_Tipo,Mes12,Mes12_Remuneracao,Mes12_Tipo,SomaMesesRemunerados
0,7206,308,D111206,Cursos de Especialização Tecnológica,M,1964-01-18,55,2,12,12 Anos,...,0,NaN,NaN,0,NaN,NaN,0,NaN,NaN,0
1,17170,206,D111206,Cursos de Especialização Tecnológica,F,1976-03-24,42,2,12,12 Anos,...,1,360.0,TCO,0,NaN,NaN,0,NaN,NaN,1

In [52]:
pedidos3.head()

,UTE_ID,CodCEFP,CodMedidaOrcam,Descritivo CodMedidaOrcam,Sexo,DataNascimento,IdadeEmAnos,Categoria,CodHabilitacao,Habilitacao,...,Mes10_Remuneracao,Mes10_Tipo,Mes11,Mes11_Remuneracao,Mes11_Tipo,Mes12,Mes12_Remuneracao,Mes12_Tipo,SomaMesesRemunerados,Sucessos
0,7206,308,D111206,Cursos de Especialização Tecnológica,M,1964-01-18,55,2,12,12 Anos,...,NaN,NaN,0,NaN,NaN,0,NaN,NaN,0,0
1,17170,206,D111206,Cursos de Especialização Tecnológica,F,1976-03-24,42,2,12,12 Anos,...,360.0,TCO,0,NaN,NaN,0,NaN,NaN,1,0
2,24054,201,D111206,Cursos de Especialização Tecnológica,F,1978-01-03,41,2,12,12 Anos,...,NaN,NaN,0,NaN,NaN,0,NaN,NaN,0,0
3,39165,309,D111206,Cursos de Especialização Tecnológica,M,1973-11-23,45,2,12,12 Anos,...,NaN,NaN,0,NaN,NaN,0,NaN,NaN,0,0
4,72408,132,D111206,Cursos de Especialização Tecnológica,M,1967-08-28,51,2,12,12 Anos,...,700.0,TCO,1,226.0,TCO,1,700.0,TCO,5,0

In [33]:
pedidos1.shape

(318253, 47)

In [34]:
pedidos2.shape

(384551, 47)

In [54]:
pedidos3.shape

(124056, 65)

<div style="background-color: #2f648a; border-radius: 5px;"> 
    <center><h1 style="color: white; padding: 20px;">3. Análise de variáveis</h1></center>
</div>

In [36]:
pedidos1['DTIPO_MOVIMENTO'].unique()

array(['MUDANÇAS CATEGORIA', 'PEDIDOS DE EMPREGO AO LONGO DO MÊS',
       'ANULAÇÕES AO LONGO DO MÊS', 'COLOCAÇÕES AO LONGO DO MÊS'],
      dtype=object)